{
    "references": [
        {
            "name": "Benji Nguyen",
            "title": "Director of Engineering",
            "employer": "Wefunder",
            "linkedIn": "https://www.linkedin.com/in/nguyen-van-benjamin/",
            "data": "I've worked with Parker now for a little over a year and am writing this recommendation as Wefunder's Director of Engineering to strongly endorse him as a software engineer. Having been around since 2013 and evolving in parallel with all of the new rules and regulations around crowdfunding, Wefunder as a funding portal has its fair share of complexities. Frankly speaking, given the pace at which we operate and the amount of founders and investors that we need to service daily, on-boarding remote engineers isn't our strong suit.\n\nParker joined us as a remote engineer—though he joins us every so often to work with us in-person for weeks at a time—back in August of 2021. Since then he has shown himself to be incredibly capable of coming into a poorly documented complex system and acquiring context based on his intuitive understanding of our business and his abilities as a programmer to be productive, execute quickly and efficiently, as well as make the appropriate trade-offs to deliver in a timely manner without accruing technical debt.\n\nParker is highly practical; combining that with his strong work ethic, his ability to deeply understand the business, his strong coding abilities, and the fact that he's a team-player who is always willing to help shoulder the burdens of his teammates made him such an incredibly value add to our engineering team.\n\nParker as an engineer is someone who cares about code quality; he is someone who pays attention to performance; and though these qualities are generally considered positive in the eyes of other engineers it could sometimes lead to the prioritization of the practice of engineering itself over the needs of the business. Finding a engineer who is able to strike a balance between carefully crafted engineering and coding in such a way that makes sense for the needs of the business seldom occurs, but Parker embodies just that; and the fact that he's always willing to assist and teach others despite constantly having a preponderance of tasks on his plate just made him that much more valuable to us.\n\nParker is someone who I valued working with and I know that future engineering teams will be incredibly fortunate to have him."
        },
        {
            "name": "Jonny Price",
            "title": "VP of Business Development",
            "employer": "Wefunder",
            "linkedIn": "https://www.linkedin.com/in/jonnyprice/",
            "data": "I had the privilege of working with Parker while he was on the Wefunder team. I led the Business Development team, while Parker was on the Engineering team. He's awesome. Parker has many strengths, but to highlight three:\n\n<ul class='list-disc'><li>He has a tremendous work ethic. Parker hustles incredibly hard. He is tenacious, resilient, and has grit. He is committed to getting the job done, even if it takes longer than originally planned. You want Parker in the trenches alongside you.</li>\n<li>He is the definition of a self-starter. There's a character in Silicon Valley — Gabe — who is a junior engineer on the Pied Piper team. He asks Dinesh really annoying questions again and again, all day long. It's absolutely infuriating for Dinesh. Parker is the opposite of Gabe. Parker will go to extreme lengths to research and figure out an answer on his own, rather than take up the time of his manager. I know this was greatly appreciated by the Wefunder leadership team.</li>\n<li>He is pragmatic. Parker was always very quick to jump into fixing bugs and solving problems. And was one of the more prolific members of the Wefunder engineering team on this front. As a member of the Business Development team, Parker was incredibly valuable in improving the experience for users rapidly and without fuss.</li></ol>\nI very much hope to work with Parker again at some point. He would be a great asset to any team."
        }
    ]
}